docs: 클래스 다이어그램 mermaid로 수정
